In [1]:
import pandas as pd

In [6]:
# -------------Rank Method------------------
nba = pd.read_csv("nba.csv").dropna(how="all")
nba["Salary"] = nba["Salary"].fillna(0).astype(int) # here astype makes all value int
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000

In [18]:
# -------------Implement our rank method----------

nba["Salary"].rank(ascending=False).astype(int)
nba["SalaryRank"] = nba["Salary"].rank(ascending=False).astype(int)
nba.sort_values(by = "Salary", ascending=False, na_position="last",inplace=True)
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,SalaryRank
109,Kobe Bryant,Los Angeles Lakers,24.0,SF,37.0,6-6,212.0,NaN,25000000,1
169,LeBron James,Cleveland Cavaliers,23.0,SF,31.0,6-8,250.0,NaN,22970500,2
33,Carmelo Anthony,New York Knicks,7.0,SF,32.0,6-8,240.0,Syracuse,22875000,3
251,Dwight Howard,Houston Rockets,12.0,C,30.0,6-11,265.0,NaN,22359364,4
339,Chris Bosh,Miami Heat,1.0,PF,32.0,6-11,235.0,Georgia Tech,22192730,5

In [28]:
# ----------------------------------------------- Filtering/Cleaning DataFrame ------------------------------------------------

emp = pd.read_csv("employees.csv")
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [59]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 954 to 451
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 48.9+ KB

In [42]:
emp["Start Date"].head()
# ---------Here we convert date to a pandas datetime field 
pd.to_datetime(emp["Start Date"])

emp["Start Date"] = pd.to_datetime(emp["Start Date"])
emp.sort_values(by = "Start Date",inplace=True)
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
954,Joe,Male,1980-01-19,4:06 PM,119667,1.148,True,Finance
49,Chris,NaN,1980-01-24,12:13 PM,113590,3.055,False,Sales
881,Ruby,Female,1980-01-28,11:08 PM,142868,6.318,False,Marketing
272,Fred,Male,1980-02-20,2:25 AM,74129,18.225,False,Product
549,Sara,Female,1980-02-25,10:50 PM,75484,3.186,False,Finance
...,...,...,...,...,...,...,...,...
239,Lillian,NaN,2016-05-12,3:43 PM,64164,17.612,False,Human Resources
444,NaN,Male,2016-05-24,9:17 PM,76409,7.008,NaN,Distribution
15,Lillian,Female,2016-06-05,6:09 AM,59414,1.256,False,Product
98,Tina,Female,2016-06-16,7:47 PM,100705,16.961,True,Marketing
451,Terry,NaN,2016-07-15,12:29 AM,140002,19.490,True,Marketing

In [48]:
# ------Convert last login-------------
emp["Last Login Time"].head()

emp["Last Login Time"] = pd.to_datetime(emp["Last Login Time"])
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
954,Joe,Male,1980-01-19,2020-02-24 16:06:00,119667,1.148,True,Finance
49,Chris,NaN,1980-01-24,2020-02-24 12:13:00,113590,3.055,False,Sales
881,Ruby,Female,1980-01-28,2020-02-24 23:08:00,142868,6.318,False,Marketing
272,Fred,Male,1980-02-20,2020-02-24 02:25:00,74129,18.225,False,Product
549,Sara,Female,1980-02-25,2020-02-24 22:50:00,75484,3.186,False,Finance

In [58]:
# --------------Senior management -------------
emp["Senior Management"].astype("bool")
emp["Senior Management"] = emp["Senior Management"].astype("bool")

# ---------------Gender Change-----------------
emp["Gender"].astype("category")
emp["Gender"] = emp["Gender"].astype("category")
emp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 954 to 451
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 48.9+ KB

In [66]:
# ------------Anouther Cleaning system----(*****)------------

df = pd.read_csv("employees.csv",parse_dates=["Start Date","Last Login Time"])
df["Senior Management"] = emp["Senior Management"].astype("bool")
df["Gender"] = emp["Gender"].astype("category")
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
First Name           933 non-null object
Gender               855 non-null category
Start Date           1000 non-null datetime64[ns]
Last Login Time      1000 non-null datetime64[ns]
Salary               1000 non-null int64
Bonus %              1000 non-null float64
Senior Management    1000 non-null bool
Team                 957 non-null object
dtypes: bool(1), category(1), datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 41.1+ KB

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-02-24 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-02-24 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-02-24 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-02-24 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-02-24 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2020-02-24 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2020-02-24 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-02-24 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-02-24 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-02-24 18:24:00,129949,10.169,True,Sales